//**********************************************************************************************
//* 이름: src/utils/global.js
//*
//* 설명: 공통 설정 관련 함수들이 정의되는 곳이다.
//*
//* 참고:
//*
//* [목차]
//*       isMobile                     접속한 기기가 모바일인지 pc인지 구분해준다. (2022.04.18)
//*       isIe                         사용자가 실행한 브라우저가 ie인지 ie가 아닌지 구분해준다. (2022.04.18)
//*
//*
//*
//**********************************************************************************************

// import ~~

//***********************************************************************************
//* 이름: isMobile
//*
//* 설명: 접속한 기기가 모바일인지 pc인지 구분해준다. (2022.04.18)
//*
//***********************************************************************************
export function isMobile() {
  if (
    /Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(
      navigator.userAgent,
    )
  ) {
    return true;
  } else {
    return false;
  }
}

//***********************************************************************************
//* 이름: isIe11
//*
//* 설명: 사용자가 실행한 브라우저가 ie인지 ie가 아닌지 구분해준다. (2022.04.18)
//*
//***********************************************************************************
export function isIe() {
  if (
    (navigator.appName === 'Netscape' &&
      navigator.userAgent.search('Trident') != -1) ||
    navigator.userAgent.toLowerCase().indexOf('msie') != -1
  ) {
    return true;
  } else {
    return false;
  }
}
